"""
json 字符串的标准化：
    1. 双引号包裹，内部双引号需要使用\"

情况1：双引号包裹，内部是单引号，json.loads()解析会失败
output = "{'区域': ['北京']}"
解决方法：output_str.replace("'", "\"")

情况2：双引号内部内容还需要单引号
output = "{'区域': ['dai'johnny']}"
解决方法：内部内容单引号使用3个转移字符\,   \\\'
"""


output = "{\"区域\": [], \"营养物质\": [], \"病虫害\": [], \"农产品\": [], \"生物特性\": [], \"别名\": []}"

item = {"id": "433e82489ca9de9d5e59c8eb9ee75078658a236e52b227f330150e4989022980",
 "task": "NER",
 "source": "AgriEvalNer",
 "instruction": "{\"instruction\": \"你是专门从事命名实体识别的农业人工智能助手专家。请从input中抽取出符合schema定义的实体，不存在的实体类型返回空列表。请按照以下的JSON字符串格式回答：{'农业技术': [], '气候': [], '作物': [], '土壤': []}\", \"schema\": [\"农业技术\", \"气候\", \"作物\", \"土壤\"], \"examples\": [{\"input\": \"玉米播种前需进行机械翻耕，这是一项常见的耕作农业技术，适用于壤土，通常在播种前阶段进行。\", \"output\": \"{'作物': ['玉米'], '农业技术': ['机械翻耕'], '土壤': ['壤土'], '气候': []}\"}, {\"input\": \"水稻属于禾本科作物，育秧是其关键生长阶段之一。\", \"output\": \"{'作物': ['水稻'], '农业技术': ['育秧'], '土壤': [], '气候': []}\"}], \"input\": \"聂凌鸿将淮山通过选料、清洗、去皮、切分、护色、打浆、浸泡、过滤、离心分离、洗涤、干燥等工序制取淮山淀粉\"}",
 "output": "{'农业技术': ['选料', '清洗', '去皮', '切分', '护色', '打浆', '浸泡', '过滤', '离心分离', '洗涤', '干燥'], '作物': ['淮山'], '土壤': [], '气候': []}",
 "label": "[{\"entity\": \"淮山\", \"entity_type\": \"作物\"}, {\"entity\": \"制取淮山淀粉\", \"entity_type\": \"用途\"}]"}
